app/controllers/campaigns_controller.rb

SELECT "campaigns".* FROM "campaigns"
---
    def index
      @entities = Campaign.all