app/controllers/investments_controller.rb

  def create
    @campaign = Campaign.find(params['campaign_id'])
    @investment = @campaign.investments.new(investment_params)
    if @investment.save
      percentage_raised = (@campaign.total_invested_amount/@campaign.target_amount)
      @campaign.update!(percentage_raised: percentage_raised)
---
SELECT "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
INSERT INTO "investments" ("campaign_id", "investor", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["campaign_id", 10], ["investor", "Pramee"], ["amount", 14.0], ["created_at", "2022-07-18 08:49:21.391810"], ["updated_at", "2022-07-18 08:49:21.391810"]]
UPDATE "campaigns" SET "percentage_raised" = $1, "updated_at" = $2 WHERE "campaigns"."id" = $3  [["percentage_raised", 0.006799417192812044], ["updated_at", "2022-07-18 08:49:21.401768"], ["id", 10]]